---
kind: method
id: M:Autodesk.Revit.DB.SolidOrShellTessellationControls.Dispose
source: html/1d540271-07f5-8292-3d4d-6ac22653555f.htm
---
# Autodesk.Revit.DB.SolidOrShellTessellationControls.Dispose Method

Releases all resources used by the SolidOrShellTessellationControls

## Syntax (C#)
```csharp
public void Dispose()
```